#!/usr/bin/env python
# -*- coding: gb18030 -*-
import requests
import csv
from bs4 import BeautifulSoup
import datetime
import re
import os
import time
import random
from requests.adapters import HTTPAdapter


class Spider():
    def __init__(self):
        self.url = 'http://www.landchina.com/default.aspx?tabid=263'

        self.city = [u'安庆市桐城市',u'安庆市岳西县',u'安庆市枞阳县',u'安庆市潜山县',u'安庆市怀宁县', u'安庆市迎江区',u'安庆市太湖县',u'安庆市望江县',u'安庆市宿松县',u'安庆市大观区', u'安庆市宜秀区',u'蚌埠市固镇县', u'蚌埠市五河县', u'蚌埠市怀远县',u'蚌埠市龙子湖区', u'蚌埠市淮上区', u'蚌埠市蚌山区', u'蚌埠市禹会区', u'亳州市谯城区', u'亳州市涡阳县', u'亳州市蒙城县', u'亳州市利辛县', u'池州市青阳县', u'池州市贵池区', u'池州市东至县', u'池州市石台县', u'滁州市凤阳县', u'滁州市天长市', u'滁州市来安县', u'滁州市定远县', u'滁州市南谯区', u'滁州市全椒县', u'滁州市明光市', u'滁州市琅琊区', u'阜阳市太和县', u'阜阳市界首市', u'阜阳市颍东区', u'阜阳市临泉县', u'阜阳市颍上县', u'阜阳市阜南县', u'阜阳市颍泉区', u'阜阳市颍州区', u'合肥市长丰县', u'合肥市肥东县', u'合肥市巢湖市', u'合肥市肥西县', u'合肥市蜀山区', u'合肥市庐江县', u'合肥市庐阳区', u'合肥市包河区', u'合肥市瑶海区', u'淮北市杜集区', u'淮北市濉溪县', u'淮北市相山区', u'淮北市烈山区', u'淮南市凤台县', u'淮南市潘集区', u'淮南市大通区', u'淮南市八公山区', u'淮南市田家庵区', u'淮南市谢家集区', u'黄山市黄山区', u'黄山市歙县', u'黄山市黟县', u'黄山市祁门县', u'黄山市休宁县', u'黄山市徽州区', u'黄山市屯溪区', u'六安市寿县', u'六安市霍邱县', u'六安市金寨县', u'六安市舒城县', u'六安市霍山县', u'六安市金安区', u'六安市裕安区', u'六安市叶集区', u'马鞍山市和县', u'马鞍山市含山县', u'马鞍山市花山区', u'马鞍山市当涂县', u'马鞍山市雨山区', u'马鞍山市博望区', u'马鞍山市金家庄区', u'铜陵市铜陵县', u'铜陵市狮子山区', u'铜陵市铜官山区', u'铜陵市郊区', u'芜湖市无为县', u'芜湖市芜湖县', u'芜湖市繁昌县', u'芜湖市南陵县', u'芜湖市镜湖区', u'芜湖市鸠江区', u'芜湖市三山区', u'芜湖市弋江区', u'宿州市砀山县', u'宿州市萧县', u'宿州市灵璧县', u'宿州市泗县', u'宿州市埇桥区', u'宣城市郎溪县', u'宣城市宣州区', u'宣城市广德县', u'宣城市泾县', u'宣城市宁国市', u'宣城市旌德县', u'宣城市绩溪县', u'澳门', u'北京市房山区', u'北京市怀柔区', u'北京市平谷区', u'北京市延庆县', u'北京市顺义区', u'北京市密云县', u'北京市通州区', u'北京市昌平区', u'北京市大兴区', u'北京市朝阳区', u'北京市崇文区', u'北京市宣武区', u'北京市西城区', u'北京市东城区', u'北京市丰台区', u'北京市海淀区', u'北京市门头沟区', u'北京市石景山区', u'福州市罗源县', u'福州市闽侯县', u'福州市闽清县', u'福州市连江县', u'福州市晋安区', u'福州市长乐市', u'福州市永泰县', u'福州市福清市', u'福州市平潭县', u'福州市仓山区', u'福州市鼓楼区', u'福州市马尾区', u'福州市台江区', u'龙岩市长汀县', u'龙岩市连城县', u'龙岩市漳平市', u'龙岩市新罗区', u'龙岩市武平县', u'龙岩市上杭县', u'龙岩市永定县', u'南平市浦城县', u'南平市武夷山市', u'南平市光泽县', u'南平市松溪县', u'南平市建阳市', u'南平市政和县', u'南平市邵武市', u'南平市建瓯市', u'南平市顺昌县', u'南平市延平区', u'宁德市寿宁县', u'宁德市福鼎市', u'宁德市福安市', u'宁德市柘荣县', u'宁德市周宁县', u'宁德市霞浦县', u'宁德市屏南县', u'宁德市蕉城区', u'宁德市古田县', u'莆田市仙游县', u'莆田市城厢区', u'莆田市涵江区', u'莆田市荔城区', u'莆田市秀屿区', u'泉州市德化县', u'泉州市永春县', u'泉州市安溪县', u'泉州市南安市', u'泉州市洛江区', u'泉州市惠安县', u'泉州市晋江市', u'泉州市石狮市', u'泉州市鲤城区', u'泉州市丰泽区', u'泉州市泉港区', u'三明市泰宁县', u'三明市建宁县', u'三明市将乐县', u'三明市沙县', u'三明市明溪县', u'三明市宁化县', u'三明市尤溪县', u'三明市三元区', u'三明市清流县', u'三明市永安市', u'三明市大田县', u'三明市梅列区', u'厦门市同安区', u'厦门市海沧区', u'厦门市湖里区', u'厦门市集美区', u'厦门市思明区', u'厦门市翔安区', u'漳州市华安县', u'漳州市南靖县', u'漳州市长泰县', u'漳州市芗城区', u'漳州市龙海市', u'漳州市平和县', u'漳州市漳浦县', u'漳州市云霄县', u'漳州市诏安县', u'漳州市东山县', u'漳州市龙文区', u'白银市景泰县', u'白银市靖远县', u'白银市白银区', u'白银市会宁县', u'白银市平川区', u'定西市安定区', u'定西市临洮县', u'定西市通渭县', u'定西市渭源县', u'定西市陇西县', u'定西市漳县', u'定西市岷县', u'甘南藏族自治州夏河县', u'甘南藏族自治州卓尼县', u'甘南藏族自治州临潭县', u'甘南藏族自治州碌曲县', u'甘南藏族自治州玛曲县', u'甘南藏族自治州迭部县', u'甘南藏族自治州舟曲县', u'甘南藏族自治州合作市', u'嘉峪关市', u'金昌市永昌县', u'金昌市金川区', u'酒泉市瓜州县', u'酒泉市敦煌市', u'酒泉市玉门市', u'酒泉市金塔县', u'酒泉市阿克塞哈萨克族自治县', u'酒泉市肃北蒙古族自治县', u'酒泉市肃州区', u'兰州市永登县', u'兰州市皋兰县', u'兰州市城关区', u'兰州市榆中县', u'兰州市红古区', u'兰州市安宁区', u'兰州市七里河区', u'兰州市西固区', u'临夏回族自治州永靖县', u'临夏回族自治州东乡族自治县', u'临夏回族自治州积石山保安族东乡族撒拉族自治县', u'临夏回族自治州临夏县', u'临夏回族自治州临夏市', u'临夏回族自治州广河县', u'临夏回族自治州和政县', u'临夏回族自治州康乐县', u'陇南市礼县', u'陇南市宕昌县', u'陇南市两当县', u'陇南市西和县', u'陇南市徽县', u'陇南市成县', u'陇南市武都区', u'陇南市康县', u'陇南市文县', u'平凉市静宁县', u'平凉市崆峒区', u'平凉市泾川县', u'平凉市庄浪县', u'平凉市华亭县', u'平凉市崇信县', u'平凉市灵台县', u'庆阳市环县', u'庆阳市华池县', u'庆阳市合水县', u'庆阳市庆城县', u'庆阳市镇原县', u'庆阳市西峰区', u'庆阳市宁县', u'庆阳市正宁县', u'天水市秦安县', u'天水市张家川回族自治县', u'天水市甘谷县', u'天水市清水县', u'天水市武山县', u'天水市麦积区', u'天水市秦州区', u'武威市民勤县', u'武威市凉州区', u'武威市古浪县', u'武威市天祝藏族自治县', u'张掖市高台县', u'张掖市肃南裕固族自治县', u'张掖市临泽县', u'张掖市甘州区', u'张掖市山丹县', u'张掖市民乐县', u'潮州市饶平县', u'潮州市潮安区', u'潮州市湘桥区', u'东莞市', u'佛山市禅城区', u'佛山市三水区', u'佛山市高明区', u'佛山市顺德区', u'广州市番禺区', u'广州市花都区', u'广州市从化区', u'广州市增城区', u'广州市白云区', u'广州市海珠区', u'广州市黄埔区', u'广州市荔湾区', u'广州市南沙区', u'广州市天河区', u'广州市越秀区', u'河源市龙川县', u'河源市和平县', u'河源市连平县', u'河源市东源县', u'河源市紫金县', u'河源市源城区', u'惠州市龙门县', u'惠州市博罗县', u'惠州市惠东县', u'惠州市惠阳区', u'惠州市惠城区', u'江门市鹤山市', u'江门市新会区', u'江门市开平市', u'江门市恩平市', u'江门市台山市', u'江门市江海区', u'江门市蓬江区', u'揭阳市揭东区', u'揭阳市揭西县', u'揭阳市普宁市', u'揭阳市惠来县', u'揭阳市东山区', u'揭阳市榕城区', u'茂名市信宜市', u'茂名市高州市', u'茂名市化州市', u'茂名市电白区', u'茂名市茂南区', u'梅州市平远县', u'梅州市蕉岭县', u'梅州市梅县', u'梅州市大埔县', u'梅州市兴宁市', u'梅州市丰顺县', u'梅州市五华县', u'梅州市梅江区', u'清远市连州市', u'清远市阳山县', u'清远市连南瑶族自治县', u'清远市连山壮族瑶族自治县', u'清远市英德市', u'清远市佛冈县', u'清远市清新区', u'清远市清城区', u'汕头市潮阳区', u'汕头市南澳县', u'汕头市澄海区', u'汕头市龙湖区', u'汕头市金平区', u'汕头市濠江区', u'汕头市潮南区', u'汕尾市陆丰市', u'汕尾市海丰县', u'汕尾市城区', u'汕尾市陆河县', u'韶关市乐昌市', u'韶关市仁化县', u'韶关市南雄市', u'韶关市始兴县', u'韶关市曲江区', u'韶关市乳源瑶族自治县', u'韶关市翁源县', u'韶关市新丰县', u'韶关市武江区', u'韶关市浈江区', u'深圳市龙岗区', u'深圳市罗湖区', u'深圳市南山区', u'深圳市福田区', u'深圳市盐田区', u'深圳市宝安区', u'阳江市阳春市', u'阳江市阳东县', u'阳江市江城区', u'阳江市阳西县', u'云浮市郁南县', u'云浮市云安区', u'云浮市罗定市', u'云浮市新兴县', u'云浮市云城区', u'湛江市廉江市', u'湛江市吴川市', u'湛江市遂溪县', u'湛江市霞山区', u'湛江市雷州市', u'湛江市徐闻县', u'湛江市坡头区', u'湛江市赤坎区', u'湛江市麻章区', u'肇庆市怀集县', u'肇庆市广宁县', u'肇庆市封开县', u'肇庆市四会市', u'肇庆市德庆县', u'肇庆市高要区', u'肇庆市端州区', u'肇庆市鼎湖区', u'中山市', u'珠海市斗门区', u'珠海市金湾区', u'珠海市香洲区', u'百色市乐业县', u'百色市隆林各族自治县', u'百色市西林县', u'百色市田林县', u'百色市凌云县', u'百色市右江区', u'百色市田阳县', u'百色市田东县', u'百色市平果县', u'百色市德保县', u'百色市靖西县', u'百色市那坡县', u'北海市合浦县', u'北海市海城区', u'北海市银海区', u'北海市铁山港区', u'崇左市天等县', u'崇左市大新县', u'崇左市扶绥县', u'崇左市江州区', u'崇左市龙州县', u'崇左市宁明县', u'崇左市凭祥市', u'防城港市上思县', u'防城港市防城区', u'防城港市东兴市', u'防城港市港口区', u'贵港市平南县', u'贵港市桂平市', u'贵港市覃塘区', u'贵港市港北区', u'贵港市港南区', u'桂林市全州县', u'桂林市资源县', u'桂林市龙胜各族自治县', u'桂林市兴安县', u'桂林市灵川县', u'桂林市灌阳县', u'桂林市永福县', u'桂林市临桂区', u'桂林市恭城瑶族自治县', u'桂林市阳朔县', u'桂林市平乐县', u'桂林市荔浦县', u'桂林市雁山区', u'桂林市象山区', u'桂林市七星区', u'桂林市叠彩区', u'桂林市秀峰区', u'河池市南丹县', u'河池市天峨县', u'河池市环江毛南族自治县', u'河池市罗城仫佬族自治县', u'河池市金城江区', u'河池市东兰县', u'河池市宜州市', u'河池市凤山县', u'河池市都安瑶族自治县', u'河池市大化瑶族自治县', u'河池市巴马瑶族自治县', u'贺州市富川瑶族自治县', u'贺州市八步区', u'贺州市钟山县', u'贺州市昭平县', u'贺州市平桂区', u'来宾市金秀瑶族自治县', u'来宾市忻城县', u'来宾市象州县', u'来宾市兴宾区', u'来宾市合山市', u'来宾市武宣县', u'柳州市三江侗族自治县', u'柳州市融水苗族自治县', u'柳州市融安县', u'柳州市鹿寨县', u'柳州市柳城县', u'柳州市鱼峰区', u'柳州市柳江县', u'柳州市柳北区', u'柳州市城中区', u'柳州市柳南区', u'南宁市马山县', u'南宁市上林县', u'南宁市武鸣县', u'南宁市宾阳县', u'南宁市隆安县', u'南宁市青秀区', u'南宁市横县', u'南宁市兴宁区', u'南宁市邕宁区', u'南宁市西乡塘区', u'南宁市良庆区', u'南宁市江南区', u'钦州市浦北县', u'钦州市灵山县', u'钦州市钦北区', u'钦州市钦南区', u'梧州市蒙山县', u'梧州市苍梧县', u'梧州市藤县', u'梧州市岑溪市', u'梧州市长洲区', u'梧州市蝶山区', u'梧州市万秀区', u'玉林市容县', u'玉林市兴业县', u'玉林市北流市', u'玉林市陆川县', u'玉林市博白县', u'玉林市福绵区', u'玉林市玉州区', u'安顺市平坝县', u'安顺市普定县', u'安顺市镇宁布依族苗族自治县', u'安顺市关岭布依族苗族自治县', u'安顺市紫云苗族布依族自治县', u'安顺市西秀区', u'毕节地区七星关区', u'毕节地区金沙县', u'毕节地区大方县', u'毕节地区威宁彝族回族苗族自治县', u'毕节地区赫章县', u'毕节地区黔西县', u'毕节地区纳雍县', u'毕节地区织金县', u'贵阳市开阳县', u'贵阳市息烽县', u'贵阳市修文县', u'贵阳市乌当区', u'贵阳市清镇市', u'贵阳市白云区', u'贵阳市花溪区', u'贵阳市南明区', u'贵阳市观山湖区', u'贵阳市小河区', u'贵阳市云岩区', u'六盘水市水城县', u'六盘水市钟山区', u'六盘水市六枝特区', u'六盘水市盘县', u'黔东南苗族侗族自治州岑巩县', u'黔东南苗族侗族自治州镇远县', u'黔东南苗族侗族自治州施秉县', u'黔东南苗族侗族自治州黄平县', u'黔东南苗族侗族自治州天柱县', u'黔东南苗族侗族自治州三穗县', u'黔东南苗族侗族自治州剑河县', u'黔东南苗族侗族自治州台江县', u'黔东南苗族侗族自治州凯里市', u'黔东南苗族侗族自治州锦屏县', u'黔东南苗族侗族自治州麻江县', u'黔东南苗族侗族自治州雷山县', u'黔东南苗族侗族自治州黎平县', u'黔东南苗族侗族自治州榕江县', u'黔东南苗族侗族自治州丹寨县', u'黔东南苗族侗族自治州从江县', u'黔南布依族苗族自治州瓮安县', u'黔南布依族苗族自治州福泉市', u'黔南布依族苗族自治州龙里县', u'黔南布依族苗族自治州贵定县', u'黔南布依族苗族自治州都匀市', u'黔南布依族苗族自治州长顺县', u'黔南布依族苗族自治州惠水县', u'黔南布依族苗族自治州三都水族自治县', u'黔南布依族苗族自治州平塘县', u'黔南布依族苗族自治州独山县', u'黔南布依族苗族自治州罗甸县', u'黔南布依族苗族自治州荔波县', u'黔西南布依族苗族自治州晴隆县', u'黔西南布依族苗族自治州普安县', u'黔西南布依族苗族自治州兴仁县', u'黔西南布依族苗族自治州贞丰县', u'黔西南布依族苗族自治州望谟县', u'黔西南布依族苗族自治州兴义市', u'黔西南布依族苗族自治州安龙县', u'黔西南布依族苗族自治州册亨县', u'铜仁地区沿河土家族自治县', u'铜仁地区德江县', u'铜仁地区松桃苗族自治县', u'铜仁地区印江土家族苗族自治县', u'铜仁地区思南县', u'铜仁地区江口县', u'铜仁地区碧江区', u'铜仁地区石阡县', u'铜仁地区万山区', u'铜仁地区玉屏侗族自治县', u'遵义市道真仡佬族苗族自治县', u'遵义市务川仡佬族苗族自治县', u'遵义市桐梓县', u'遵义市习水县', u'遵义市正安县', u'遵义市赤水市', u'遵义市绥阳县', u'遵义市凤冈县', u'遵义市湄潭县', u'遵义市仁怀市', u'遵义市遵义县', u'遵义市余庆县', u'遵义市红花岗区', u'遵义市汇川区', u'白沙黎族自治县', u'保亭黎族苗族自治县', u'昌江黎族自治县', u'澄迈县', u'儋州市', u'定安县', u'东方市', u'海口市琼山区', u'海口市秀英区', u'海口市龙华区', u'海口市美兰区', u'乐东黎族自治县', u'临高县', u'陵水黎族自治县', u'琼海市', u'琼中黎族苗族自治县', u'三亚市', u'屯昌县', u'万宁市', u'文昌市', u'五指山市', u'保定市涞水县', u'保定市涞源县', u'保定市涿州市', u'保定市易县', u'保定市高碑店市', u'保定市定兴县', u'保定市雄县', u'保定市徐水县', u'保定市容城县', u'保定市满城县', u'保定市顺平县', u'保定市唐县', u'保定市阜平县', u'保定市安新县', u'保定市清苑县', u'保定市曲阳县', u'保定市望都县', u'保定市高阳县', u'保定市蠡县', u'保定市定州市', u'保定市博野县', u'保定市安国市', u'保定市南市区', u'保定市北市区', u'保定市新市区', u'沧州市任丘市', u'沧州市青县', u'沧州市黄骅市', u'沧州市河间市', u'沧州市沧县', u'沧州市肃宁县', u'沧州市献县', u'沧州市海兴县', u'沧州市孟村回族自治县', u'沧州市泊头市', u'沧州市南皮县', u'沧州市盐山县', u'沧州市东光县', u'沧州市吴桥县', u'沧州市新华区', u'沧州市运河区', u'承德市围场满族蒙古族自治县', u'承德市丰宁满族自治县', u'承德市隆化县', u'承德市承德县', u'承德市平泉县', u'承德市滦平县', u'承德市双桥区', u'承德市宽城满族自治县', u'承德市兴隆县', u'承德市双滦区', u'承德市鹰手营子矿区', u'邯郸市武安市', u'邯郸市鸡泽县', u'邯郸市曲周县', u'邯郸市邱县', u'邯郸市永年县', u'邯郸市涉县', u'邯郸市馆陶县', u'邯郸市邯郸县', u'邯郸市肥乡县', u'邯郸市广平县', u'邯郸市峰峰矿区', u'邯郸市磁县', u'邯郸市成安县', u'邯郸市大名县', u'邯郸市魏县', u'邯郸市临漳县', u'邯郸市邯山区', u'邯郸市复兴区', u'邯郸市丛台区', u'衡水市安平县', u'衡水市饶阳县', u'衡水市深州市', u'衡水市武强县', u'衡水市武邑县', u'衡水市阜城县', u'衡水市景县', u'衡水市桃城区', u'衡水市冀州市', u'衡水市枣强县', u'衡水市故城县', u'廊坊市三河市', u'廊坊市大厂回族自治县', u'廊坊市香河县', u'廊坊市安次区', u'廊坊市固安县', u'廊坊市永清县', u'廊坊市霸州市', u'廊坊市文安县', u'廊坊市大城县', u'廊坊市广阳区', u'秦皇岛市青龙满族自治县', u'秦皇岛市抚宁县', u'秦皇岛市卢龙县', u'秦皇岛市昌黎县', u'秦皇岛市北戴河区', u'秦皇岛市海港区', u'秦皇岛市山海关区', u'石家庄市平山县', u'石家庄市灵寿县', u'石家庄市行唐县', u'石家庄市新乐市', u'石家庄市正定县', u'石家庄市深泽县', u'石家庄市鹿泉市', u'石家庄市藁城市', u'石家庄市无极县', u'石家庄市井陉矿区', u'石家庄市晋州市', u'石家庄市辛集市', u'石家庄市长安区', u'石家庄市栾城县', u'石家庄市元氏县', u'石家庄市赵县', u'石家庄市赞皇县', u'石家庄市高邑县', u'石家庄市桥东区', u'石家庄市桥西区', u'石家庄市新华区', u'石家庄市井陉县', u'石家庄市裕华区', u'唐山市迁西县', u'唐山市遵化市', u'唐山市迁安市', u'唐山市丰南区', u'唐山市滦县', u'唐山市玉田县', u'唐山市滦南县', u'唐山市曹妃甸区', u'唐山市乐亭县', u'唐山市丰润区', u'唐山市开平区', u'唐山市古冶区', u'唐山市路南区', u'唐山市路北区', u'邢台市宁晋县', u'邢台市柏乡县', u'邢台市新河县', u'邢台市临城县', u'邢台市隆尧县', u'邢台市南宫市', u'邢台市内丘县', u'邢台市巨鹿县', u'邢台市邢台县', u'邢台市威县', u'邢台市广宗县', u'邢台市任县', u'邢台市清河县', u'邢台市平乡县', u'邢台市南和县', u'邢台市沙河市', u'邢台市临西县', u'邢台市桥东区', u'邢台市桥西区', u'张家口市康保县', u'张家口市沽源县', u'张家口市张北县', u'张家口市尚义县', u'张家口市赤城县', u'张家口市崇礼县', u'张家口市万全县', u'张家口市宣化区', u'张家口市宣化县', u'张家口市怀安县', u'张家口市怀来县', u'张家口市涿鹿县', u'张家口市阳原县', u'张家口市蔚县', u'张家口市下花园区', u'张家口市桥西区', u'张家口市桥东区', u'安阳市林州市', u'安阳市安阳县', u'安阳市内黄县', u'安阳市汤阴县', u'安阳市滑县', u'安阳市文峰区', u'安阳市北关区', u'安阳市龙安区', u'安阳市殷都区', u'鹤壁市淇县', u'鹤壁市浚县', u'鹤壁市淇滨区', u'鹤壁市鹤山区', u'鹤壁市山城区', u'济源市', u'焦作市博爱县', u'焦作市沁阳市', u'焦作市武陟县', u'焦作市温县', u'焦作市孟州市', u'焦作市修武县', u'焦作市中站区', u'焦作市山阳区', u'焦作市马村区', u'焦作市解放区', u'开封市兰考县', u'开封市开封县', u'开封市杞县', u'开封市尉氏县', u'开封市通许县', u'开封市顺河回族区', u'开封市鼓楼区', u'开封市金明区', u'开封市龙亭区', u'开封市禹王台区', u'洛阳市新安县', u'洛阳市孟津县', u'洛阳市偃师市', u'洛阳市洛龙区', u'洛阳市伊川县', u'洛阳市宜阳县', u'洛阳市栾川县', u'洛阳市嵩县', u'洛阳市汝阳县', u'洛阳市洛宁县', u'洛阳市吉利区', u'洛阳市西工区', u'洛阳市廛河回族区', u'洛阳市涧西区', u'洛阳市老城区', u'漯河市临颍县', u'漯河市郾城区', u'漯河市舞阳县', u'漯河市召陵区', u'漯河市源汇区', u'南阳市西峡县', u'南阳市南召县', u'南阳市方城县', u'南阳市内乡县', u'南阳市镇平县', u'南阳市淅川县', u'南阳市社旗县', u'南阳市卧龙区', u'南阳市邓州市', u'南阳市唐河县', u'南阳市新野县', u'南阳市桐柏县', u'南阳市宛城区', u'平顶山市汝州市', u'平顶山市郏县', u'平顶山市宝丰县', u'平顶山市鲁山县', u'平顶山市新华区', u'平顶山市叶县', u'平顶山市舞钢市', u'平顶山市石龙区', u'平顶山市卫东区', u'平顶山市湛河区', u'濮阳市南乐县', u'濮阳市台前县', u'濮阳市清丰县', u'濮阳市范县', u'濮阳市华龙区', u'濮阳市濮阳县', u'三门峡市渑池县', u'三门峡市义马市', u'三门峡市湖滨区', u'三门峡市陕县', u'三门峡市灵宝市', u'三门峡市卢氏县', u'商丘市民权县', u'商丘市宁陵县', u'商丘市虞城县', u'商丘市睢县', u'商丘市睢阳区', u'商丘市夏邑县', u'商丘市柘城县', u'商丘市永城市', u'商丘市梁园区', u'新乡市辉县市', u'新乡市卫辉市', u'新乡市延津县', u'新乡市新乡县', u'新乡市长垣县', u'新乡市获嘉县', u'新乡市封丘县', u'新乡市原阳县', u'新乡市卫滨区', u'新乡市牧野区', u'新乡市红旗区', u'新乡市凤泉区', u'信阳市息县', u'信阳市淮滨县', u'信阳市固始县', u'信阳市潢川县', u'信阳市罗山县', u'信阳市光山县', u'信阳市商城县', u'信阳市新县', u'信阳市平桥区', u'信阳市浉河区', u'许昌市禹州市', u'许昌市长葛市', u'许昌市鄢陵县', u'许昌市许昌县', u'许昌市魏都区', u'许昌市襄城县', u'郑州市荥阳市', u'郑州市中牟县', u'郑州市管城回族区', u'郑州市巩义市', u'郑州市新密市', u'郑州市新郑市', u'郑州市登封市', u'郑州市二七区', u'郑州市惠济区', u'郑州市金水区', u'郑州市上街区', u'郑州市中原区', u'周口市扶沟县', u'周口市太康县', u'周口市鹿邑县', u'周口市西华县', u'周口市淮阳县', u'周口市郸城县', u'周口市商水县', u'周口市川汇区', u'周口市沈丘县', u'周口市项城市', u'驻马店市西平县', u'驻马店市上蔡县', u'驻马店市遂平县', u'驻马店市平舆县', u'驻马店市汝南县', u'驻马店市泌阳县', u'驻马店市驿城区', u'驻马店市确山县', u'驻马店市新蔡县', u'驻马店市正阳县', u'大庆市林甸县', u'大庆市杜尔伯特蒙古族自治县', u'大庆市萨尔图区', u'大庆市肇州县', u'大庆市肇源县', u'大庆市让胡路区', u'大庆市大同区', u'大庆市红岗区', u'大庆市龙凤区', u'大兴安岭地区漠河县', u'大兴安岭地区塔河县', u'大兴安岭地区呼中区', u'大兴安岭地区呼玛县', u'大兴安岭地区新林区', u'哈尔滨市依兰县', u'哈尔滨市通河县', u'哈尔滨市巴彦县', u'哈尔滨市木兰县', u'哈尔滨市方正县', u'哈尔滨市宾县', u'哈尔滨市延寿县', u'哈尔滨市松北区', u'哈尔滨市尚志市', u'哈尔滨市双城市', u'哈尔滨市五常市', u'哈尔滨市阿城区', u'哈尔滨市呼兰区', u'哈尔滨市平房区', u'哈尔滨市南岗区', u'哈尔滨市道里区', u'哈尔滨市道外区', u'哈尔滨市香坊区', u'鹤岗市萝北县', u'鹤岗市东山区', u'鹤岗市绥滨县', u'鹤岗市兴安区', u'鹤岗市兴山区', u'鹤岗市向阳区', u'鹤岗市南山区', u'鹤岗市工农区', u'黑河市爱辉区', u'黑河市嫩江县', u'黑河市逊克县', u'黑河市孙吴县', u'黑河市五大连池市', u'黑河市北安市', u'鸡西市虎林市', u'鸡西市密山市', u'鸡西市鸡东县', u'鸡西市恒山区', u'鸡西市城子河区', u'鸡西市滴道区', u'鸡西市鸡冠区', u'鸡西市麻山区', u'鸡西市梨树区', u'佳木斯市抚远县', u'佳木斯市同江市', u'佳木斯市富锦市', u'佳木斯市桦川县', u'佳木斯市汤原县', u'佳木斯市桦南县', u'佳木斯市郊区', u'佳木斯市东风区', u'佳木斯市前进区', u'佳木斯市向阳区', u'牡丹江市林口县', u'牡丹江市海林市', u'牡丹江市穆棱市', u'牡丹江市东宁县', u'牡丹江市绥芬河市', u'牡丹江市宁安市', u'牡丹江市阳明区', u'牡丹江市西安区', u'牡丹江市东安区', u'牡丹江市爱民区', u'七台河市勃利县', u'七台河市茄子河区', u'七台河市桃山区', u'七台河市新兴区', u'齐齐哈尔市讷河市', u'齐齐哈尔市克山县', u'齐齐哈尔市克东县', u'齐齐哈尔市依安县', u'齐齐哈尔市拜泉县', u'齐齐哈尔市富裕县', u'齐齐哈尔市梅里斯达斡尔族区', u'齐齐哈尔市龙江县', u'齐齐哈尔市泰来县', u'齐齐哈尔市甘南县', u'齐齐哈尔市建华区', u'齐齐哈尔市富拉尔基区', u'齐齐哈尔市龙沙区', u'齐齐哈尔市碾子山区', u'齐齐哈尔市铁锋区', u'齐齐哈尔市昂昂溪区', u'双鸭山市饶河县', u'双鸭山市宝清县', u'双鸭山市友谊县', u'双鸭山市集贤县', u'双鸭山市宝山区', u'双鸭山市四方台区', u'双鸭山市尖山区', u'双鸭山市岭东区', u'绥化市绥棱县', u'绥化市海伦市', u'绥化市庆安县', u'绥化市明水县', u'绥化市北林区', u'绥化市望奎县', u'绥化市青冈县', u'绥化市兰西县', u'绥化市肇东市', u'绥化市安达市', u'伊春市嘉荫县', u'伊春市美溪区', u'伊春市铁力市', u'伊春市乌伊岭区', u'伊春市汤旺河区', u'伊春市新青区', u'伊春市红星区', u'伊春市友好区', u'伊春市翠峦区', u'伊春市五营区', u'伊春市上甘岭区', u'伊春市南岔区', u'伊春市伊春区', u'伊春市金山屯区', u'伊春市西林区', u'伊春市乌马河区', u'伊春市带岭区', u'鄂州市鄂城区', u'鄂州市华容区', u'鄂州市梁子湖区', u'恩施土家族苗族自治州巴东县', u'恩施土家族苗族自治州恩施市城区', u'恩施土家族苗族自治州鹤峰县', u'恩施土家族苗族自治州建始县', u'恩施土家族苗族自治州来凤县', u'恩施土家族苗族自治州利川市', u'恩施土家族苗族自治州咸丰县', u'恩施土家族苗族自治州宣恩县', u'黄冈市红安县', u'黄冈市黄梅县', u'黄冈市黄州区', u'黄冈市罗田县', u'黄冈市麻城市', u'黄冈市蕲春县', u'黄冈市团风县', u'黄冈市武穴市', u'黄冈市浠水县', u'黄冈市英山县', u'黄石市大冶市', u'黄石市黄石港区', u'黄石市铁山区', u'黄石市西塞山区', u'黄石市下陆区', u'黄石市阳新县', u'荆门市东宝区', u'荆门市掇刀区', u'荆门市京山县', u'荆门市沙洋县', u'荆门市钟祥市', u'荆州市公安县', u'荆州市洪湖市', u'荆州市监利县', u'荆州市江陵县', u'荆州市荆州区', u'荆州市沙市区', u'荆州市石首市', u'荆州市松滋市', u'潜江市', u'神农架林区', u'十堰市丹江口市', u'十堰市房县', u'十堰市茅箭区', u'十堰市郧西县', u'十堰市郧阳区', u'十堰市张湾区', u'十堰市竹山县', u'十堰市竹溪县', u'随州市曾都区', u'随州市广水市', u'随州市随县', u'天门市', u'武汉市蔡甸区', u'武汉市东西湖区', u'武汉市汉南区', u'武汉市汉阳区', u'武汉市洪山区', u'武汉市黄陂区', u'武汉市江岸区', u'武汉市江汉区', u'武汉市江夏区', u'武汉市硚口区', u'武汉市青山区', u'武汉市武昌区', u'武汉市新洲区', u'仙桃市', u'咸宁市赤壁市', u'咸宁市崇阳县', u'咸宁市嘉鱼县', u'咸宁市通城县', u'咸宁市通山县', u'咸宁市咸安区', u'襄阳市保康县', u'襄阳市樊城区', u'襄阳市谷城县', u'襄阳市老河口市', u'襄阳市南漳县', u'襄阳市襄城区', u'襄阳市襄州区', u'襄阳市宜城市', u'襄阳市枣阳市', u'孝感市安陆市', u'孝感市大悟县', u'孝感市汉川市', u'孝感市孝昌县', u'孝感市孝南区', u'孝感市应城市', u'孝感市云梦县', u'宜昌市当阳市', u'宜昌市点军区', u'宜昌市五峰土家族自治县', u'宜昌市伍家岗区', u'宜昌市西陵区', u'宜昌市猇亭区', u'宜昌市兴山县', u'宜昌市夷陵区', u'宜昌市宜都市', u'宜昌市远安县', u'宜昌市长阳土家族自治县', u'宜昌市枝江市', u'宜昌市秭归县', u'常德市石门县', u'常德市澧县', u'常德市临澧县', u'常德市安乡县', u'常德市桃源县', u'常德市鼎城区', u'常德市汉寿县', u'常德市津市市', u'常德市武陵区', u'郴州市安仁县', u'郴州市永兴县', u'郴州市资兴市', u'郴州市桂东县', u'郴州市桂阳县', u'郴州市苏仙区', u'郴州市汝城县', u'郴州市嘉禾县', u'郴州市宜章县', u'郴州市临武县', u'郴州市北湖区', u'衡阳市衡山县', u'衡阳市衡东县', u'衡阳市衡阳县', u'衡阳市祁东县', u'衡阳市衡南县', u'衡阳市耒阳市', u'衡阳市常宁市', u'衡阳市南岳区', u'衡阳市石鼓区', u'衡阳市雁峰区', u'衡阳市蒸湘区', u'衡阳市珠晖区', u'怀化市沅陵县', u'怀化市溆浦县', u'怀化市辰溪县', u'怀化市麻阳苗族自治县', u'怀化市中方县', u'怀化市芷江侗族自治县', u'怀化市新晃侗族自治县', u'怀化市会同县', u'怀化市靖州苗族侗族自治县', u'怀化市通道侗族自治县', u'怀化市洪江市', u'怀化市鹤城区', u'娄底市新化县', u'娄底市涟源市', u'娄底市娄星区', u'娄底市冷水江市', u'娄底市双峰县', u'邵阳市隆回县', u'邵阳市新邵县', u'邵阳市邵东县', u'邵阳市洞口县', u'邵阳市邵阳县', u'邵阳市绥宁县', u'邵阳市武冈市', u'邵阳市新宁县', u'邵阳市城步苗族自治县', u'邵阳市大祥区', u'邵阳市双清区', u'邵阳市北塔区', u'湘潭市湘潭县', u'湘潭市湘乡市', u'湘潭市韶山市', u'湘潭市雨湖区', u'湘潭市岳塘区', u'湘西土家族苗族自治州龙山县', u'湘西土家族苗族自治州永顺县', u'湘西土家族苗族自治州保靖县', u'湘西土家族苗族自治州古丈县', u'湘西土家族苗族自治州花垣县', u'湘西土家族苗族自治州吉首市', u'湘西土家族苗族自治州泸溪县', u'湘西土家族苗族自治州凤凰县', u'益阳市南县', u'益阳市桃江县', u'益阳市安化县', u'益阳市沅江市', u'益阳市赫山区', u'益阳市资阳区', u'永州市东安县', u'永州市祁阳县', u'永州市零陵区', u'永州市双牌县', u'永州市宁远县', u'永州市新田县', u'永州市道县', u'永州市蓝山县', u'永州市江永县', u'永州市江华瑶族自治县', u'永州市冷水滩区', u'岳阳市华容县', u'岳阳市临湘市', u'岳阳市平江县', u'岳阳市汨罗市', u'岳阳市岳阳县', u'岳阳市湘阴县', u'岳阳市岳阳楼区', u'岳阳市云溪区', u'岳阳市君山区', u'张家界市桑植县', u'张家界市慈利县', u'张家界市永定区', u'张家界市武陵源区', u'长沙市长沙县', u'长沙市浏阳市', u'长沙市宁乡县', u'长沙市岳麓区', u'长沙市开福区', u'长沙市天心区', u'长沙市雨花区', u'长沙市望城区', u'长沙市芙蓉区', u'株洲市醴陵市', u'株洲市株洲县', u'株洲市攸县', u'株洲市茶陵县', u'株洲市炎陵县', u'株洲市天元区', u'株洲市石峰区', u'株洲市荷塘区', u'株洲市芦淞区', u'白城市镇赉县', u'白城市洮南市', u'白城市大安市', u'白城市洮北区', u'白城市通榆县', u'白山市抚松县', u'白山市靖宇县', u'白山市临江市', u'白山市长白朝鲜族自治县', u'白山市江源区', u'白山市浑江区', u'吉林市舒兰市', u'吉林市永吉县', u'吉林市蛟河市', u'吉林市桦甸市', u'吉林市磐石市', u'吉林市船营区', u'吉林市昌邑区', u'吉林市龙潭区', u'吉林市丰满区', u'辽源市东辽县', u'辽源市东丰县', u'辽源市龙山区', u'辽源市西安区', u'四平市公主岭市', u'四平市双辽市', u'四平市梨树县', u'四平市伊通满族自治县', u'四平市铁东区', u'四平市铁西区', u'松原市扶余市', u'松原市前郭尔罗斯蒙古族自治县', u'松原市乾安县', u'松原市长岭县', u'松原市宁江区', u'通化市梅河口市', u'通化市辉南县', u'通化市柳河县', u'通化市二道江区', u'通化市集安市', u'通化市通化县', u'通化市东昌区', u'延边朝鲜族自治州敦化市', u'延边朝鲜族自治州汪清县', u'延边朝鲜族自治州珲春市', u'延边朝鲜族自治州龙井市', u'延边朝鲜族自治州安图县', u'延边朝鲜族自治州图们市', u'延边朝鲜族自治州和龙市', u'延边朝鲜族自治州延吉市', u'长春市榆树市', u'长春市农安县', u'长春市德惠市', u'长春市九台市', u'长春市双阳区', u'长春市宽城区', u'长春市二道区', u'长春市朝阳区', u'长春市绿园区', u'长春市南关区', u'常州市武进区', u'常州市金坛市', u'常州市溧阳市', u'常州市新北区', u'常州市天宁区', u'常州市钟楼区', u'常州市戚墅堰区', u'淮安市涟水县', u'淮安市淮阴区', u'淮安市金湖县', u'淮安市盱眙县', u'淮安市洪泽县', u'淮安市清浦区', u'淮安市清河区', u'淮安市淮安区', u'连云港市赣榆县', u'连云港市连云区', u'连云港市东海县', u'连云港市灌云县', u'连云港市灌南县', u'连云港市新浦区', u'连云港市海州区', u'南京市江宁区', u'南京市溧水区', u'南京市高淳区', u'南京市雨花台区', u'南京市玄武区', u'南京市鼓楼区', u'南京市建邺区', u'南京市六合区', u'南京市浦口区', u'南京市栖霞区', u'南京市秦淮区', u'南通市海安县', u'南通市如东县', u'南通市如皋市', u'南通市海门市', u'南通市启东市', u'南通市通州区', u'南通市崇川区', u'南通市港闸区', u'苏州市张家港市', u'苏州市常熟市', u'苏州市太仓市', u'苏州市昆山市', u'苏州市吴中区', u'苏州市虎丘区', u'苏州市姑苏区', u'苏州市吴江区', u'苏州市相城区', u'泰州市兴化市', u'泰州市姜堰区', u'泰州市泰兴市', u'泰州市靖江市', u'泰州市海陵区', u'泰州市高港区', u'无锡市江阴市', u'无锡市滨湖区', u'无锡市宜兴市', u'无锡市锡山区', u'无锡市惠山区', u'无锡市崇安区', u'无锡市北塘区', u'无锡市南长区', u'宿迁市沭阳县', u'宿迁市宿豫区', u'宿迁市泗洪县', u'宿迁市泗阳县', u'宿迁市宿城区', u'徐州市丰县', u'徐州市沛县', u'徐州市邳州市', u'徐州市新沂市', u'徐州市铜山区', u'徐州市睢宁县', u'徐州市贾汪区', u'徐州市泉山区', u'徐州市九里区', u'徐州市鼓楼区', u'徐州市云龙区', u'盐城市响水县', u'盐城市滨海县', u'盐城市射阳县', u'盐城市阜宁县', u'盐城市建湖县', u'盐城市大丰市', u'盐城市盐都区', u'盐城市东台市', u'盐城市亭湖区', u'扬州市宝应县', u'扬州市高邮市', u'扬州市仪征市', u'扬州市江都区', u'扬州市邗江区', u'扬州市广陵区', u'扬州市维扬区', u'镇江市扬中市', u'镇江市丹徒区', u'镇江市句容市', u'镇江市丹阳市', u'镇江市京口区', u'镇江市润州区', u'抚州市东乡县', u'抚州市临川区', u'抚州市金溪县', u'抚州市资溪县', u'抚州市崇仁县', u'抚州市南城县', u'抚州市宜黄县', u'抚州市乐安县', u'抚州市黎川县', u'抚州市南丰县', u'抚州市广昌县', u'赣州市宁都县', u'赣州市兴国县', u'赣州市石城县', u'赣州市于都县', u'赣州市瑞金市', u'赣州市赣县', u'赣州市南康市', u'赣州市上犹县', u'赣州市会昌县', u'赣州市章贡区', u'赣州市崇义县', u'赣州市安远县', u'赣州市大余县', u'赣州市信丰县', u'赣州市寻乌县', u'赣州市全南县', u'赣州市定南县', u'赣州市龙南县', u'吉安市新干县', u'吉安市峡江县', u'吉安市吉安县', u'吉安市安福县', u'吉安市永丰县', u'吉安市吉水县', u'吉安市永新县', u'吉安市泰和县', u'吉安市井冈山市', u'吉安市万安县', u'吉安市遂川县', u'吉安市吉州区', u'吉安市青原区', u'景德镇市浮梁县', u'景德镇市乐平市', u'景德镇市昌江区', u'景德镇市珠山区', u'九江市彭泽县', u'九江市湖口县', u'九江市瑞昌市', u'九江市庐山区', u'九江市都昌县', u'九江市德安县', u'九江市星子县', u'九江市武宁县', u'九江市永修县', u'九江市修水县', u'九江市共青城市', u'九江市九江县', u'九江市浔阳区', u'南昌市新建县', u'南昌市安义县', u'南昌市南昌县', u'南昌市进贤县', u'南昌市湾里区', u'南昌市青山湖区', u'南昌市东湖区', u'南昌市西湖区', u'南昌市青云谱区', u'萍乡市湘东区', u'萍乡市莲花县', u'萍乡市芦溪县', u'萍乡市上栗县', u'萍乡市安源区', u'上饶市鄱阳县', u'上饶市婺源县', u'上饶市德兴市', u'上饶市玉山县', u'上饶市上饶县', u'上饶市余干县', u'上饶市万年县', u'上饶市弋阳县', u'上饶市横峰县', u'上饶市广丰县', u'上饶市信州区', u'上饶市铅山县', u'新余市分宜县', u'新余市渝水区', u'宜春市靖安县', u'宜春市奉新县', u'宜春市铜鼓县', u'宜春市高安市', u'宜春市宜丰县', u'宜春市丰城市', u'宜春市万载县', u'宜春市上高县', u'宜春市樟树市', u'宜春市袁州区', u'鹰潭市贵溪市', u'鹰潭市余江县', u'鹰潭市月湖区', u'鞍山市台安县', u'鞍山市千山区', u'鞍山市海城市', u'鞍山市岫岩满族自治县', u'鞍山市铁东区', u'鞍山市立山区', u'鞍山市铁西区', u'本溪市桓仁满族自治县', u'本溪市本溪满族自治县', u'本溪市南芬区', u'本溪市溪湖区', u'本溪市平山区', u'本溪市明山区', u'朝阳市北票市', u'朝阳市建平县', u'朝阳市朝阳县', u'朝阳市喀喇沁左翼蒙古族自治县', u'朝阳市凌源市', u'朝阳市双塔区', u'朝阳市龙城区', u'大连市庄河市', u'大连市瓦房店市', u'大连市普兰店市', u'大连市长海县', u'大连市金州区', u'大连市旅顺口区', u'大连市甘井子区', u'大连市中山区', u'大连市沙河口区', u'大连市西岗区', u'丹东市宽甸满族自治县', u'丹东市凤城市', u'丹东市东港市', u'丹东市元宝区', u'丹东市振安区', u'丹东市振兴区', u'抚顺市清原满族自治县', u'抚顺市抚顺县', u'抚顺市新宾满族自治县', u'抚顺市顺城区', u'抚顺市新抚区', u'抚顺市望花区', u'抚顺市东洲区', u'阜新市彰武县', u'阜新市阜新蒙古族自治县', u'阜新市细河区', u'阜新市新邱区', u'阜新市海州区', u'阜新市太平区', u'阜新市清河门区', u'葫芦岛市连山区', u'葫芦岛市建昌县', u'葫芦岛市兴城市', u'葫芦岛市绥中县', u'葫芦岛市龙港区', u'葫芦岛市南票区', u'锦州市黑山县', u'锦州市北镇市', u'锦州市义县', u'锦州市凌海市', u'锦州市太和区', u'锦州市凌河区', u'锦州市古塔区', u'辽阳市灯塔市', u'辽阳市辽阳县', u'辽阳市弓长岭区', u'辽阳市宏伟区', u'辽阳市太子河区', u'辽阳市白塔区', u'辽阳市文圣区', u'盘锦市盘山县', u'盘锦市大洼县', u'盘锦市双台子区', u'盘锦市兴隆台区', u'沈阳市康平县', u'沈阳市法库县', u'沈阳市新民市', u'沈阳市东陵区（改为浑南区）', u'沈阳市辽中县', u'沈阳市和平区', u'沈阳市皇姑区', u'沈阳市浑南区', u'沈阳市沈北新区', u'沈阳市沈河区', u'沈阳市苏家屯区', u'沈阳市铁西区', u'沈阳市于洪区', u'沈阳市大东区', u'铁岭市昌图县', u'铁岭市西丰县', u'铁岭市开原市', u'铁岭市调兵山市', u'铁岭市铁岭县', u'铁岭市银州区', u'铁岭市清河区', u'营口市大石桥市', u'营口市老边区', u'营口市盖州市', u'营口市鲅鱼圈区', u'营口市站前区', u'营口市西市区', u'阿拉善盟额济纳旗', u'阿拉善盟阿拉善右旗', u'阿拉善盟阿拉善左旗', u'巴彦淖尔市乌拉特后旗', u'巴彦淖尔市乌拉特前旗', u'巴彦淖尔市临河区', u'巴彦淖尔市五原县', u'巴彦淖尔市杭锦后旗', u'巴彦淖尔市乌拉特中旗', u'巴彦淖尔市磴口县', u'包头市达尔罕茂明安联合旗', u'包头市固阳县', u'包头市土默特右旗', u'包头市石拐区', u'包头市昆都仑区', u'包头市九原区', u'包头市青山区', u'包头市东河区', u'包头市白云鄂博矿区', u'赤峰市阿鲁科尔沁旗', u'赤峰市巴林左旗', u'赤峰市巴林右旗', u'赤峰市林西县', u'赤峰市克什克腾旗', u'赤峰市翁牛特旗', u'赤峰市敖汉旗', u'赤峰市松山区', u'赤峰市喀喇沁旗', u'赤峰市宁城县', u'赤峰市元宝山区', u'赤峰市红山区', u'鄂尔多斯市杭锦旗', u'鄂尔多斯市达拉特旗', u'鄂尔多斯市准格尔旗', u'鄂尔多斯市鄂托克旗', u'鄂尔多斯市东胜区', u'鄂尔多斯市伊金霍洛旗', u'鄂尔多斯市乌审旗', u'鄂尔多斯市鄂托克前旗', u'呼和浩特市武川县', u'呼和浩特市赛罕区', u'呼和浩特市土默特左旗', u'呼和浩特市和林格尔县', u'呼和浩特市托克托县', u'呼和浩特市清水河县', u'呼和浩特市回民区', u'呼和浩特市玉泉区', u'呼和浩特市新城区', u'呼伦贝尔市额尔古纳市', u'呼伦贝尔市根河市', u'呼伦贝尔市鄂伦春自治旗', u'呼伦贝尔市牙克石市', u'呼伦贝尔市莫力达瓦达斡尔族自治旗', u'呼伦贝尔市陈巴尔虎旗', u'呼伦贝尔市新巴尔虎右旗', u'呼伦贝尔市新巴尔虎左旗', u'呼伦贝尔市阿荣旗', u'呼伦贝尔市满洲里市', u'呼伦贝尔市海拉尔区', u'呼伦贝尔市鄂温克族自治旗', u'呼伦贝尔市扎兰屯市', u'呼伦贝尔市加格达奇区', u'呼伦贝尔市松岭区', u'通辽市霍林郭勒市', u'通辽市扎鲁特旗', u'通辽市科尔沁左翼后旗', u'通辽市开鲁县', u'通辽市科尔沁区', u'通辽市科尔沁左翼中旗', u'通辽市奈曼旗', u'通辽市库伦旗', u'乌海市海南区', u'乌海市乌达区', u'乌海市海勃湾区', u'乌兰察布市四子王旗', u'乌兰察布市化德县', u'乌兰察布市商都县', u'乌兰察布市察哈尔右翼后旗', u'乌兰察布市察哈尔右翼中旗', u'乌兰察布市兴和县', u'乌兰察布市卓资县', u'乌兰察布市察哈尔右翼前旗', u'乌兰察布市集宁区', u'乌兰察布市凉城县', u'乌兰察布市丰镇市', u'锡林郭勒盟东乌珠穆沁旗', u'锡林郭勒盟西乌珠穆沁旗', u'锡林郭勒盟阿巴嘎旗', u'锡林郭勒盟苏尼特左旗', u'锡林郭勒盟锡林浩特市', u'锡林郭勒盟二连浩特市', u'锡林郭勒盟苏尼特右旗', u'锡林郭勒盟正蓝旗', u'锡林郭勒盟正镶白旗', u'锡林郭勒盟镶黄旗', u'锡林郭勒盟多伦县', u'锡林郭勒盟太仆寺旗', u'兴安盟科尔沁右翼前旗', u'兴安盟扎赉特旗', u'兴安盟乌兰浩特市', u'兴安盟突泉县', u'兴安盟科尔沁右翼中旗', u'兴安盟阿尔山市', u'固原市原州区', u'固原市彭阳县', u'固原市西吉县', u'固原市隆德县', u'固原市泾源县', u'石嘴山市惠农区', u'石嘴山市大武口区', u'石嘴山市平罗县', u'吴忠市青铜峡市', u'吴忠市盐池县', u'吴忠市利通区', u'吴忠市同心县', u'吴忠市红寺堡区', u'银川市永宁县', u'银川市灵武市', u'银川市贺兰县', u'银川市西夏区', u'银川市金凤区', u'银川市兴庆区', u'中卫市中宁县', u'中卫市沙坡头区', u'中卫市海原县', u'果洛藏族自治州玛多县', u'果洛藏族自治州玛沁县', u'果洛藏族自治州甘德县', u'果洛藏族自治州达日县', u'果洛藏族自治州久治县', u'果洛藏族自治州班玛县', u'海北藏族自治州祁连县', u'海北藏族自治州刚察县', u'海北藏族自治州门源回族自治县', u'海北藏族自治州海晏县', u'海东市互助土族自治县', u'海东市乐都区', u'海东市平安县', u'海东市民和回族土族自治县', u'海东市化隆回族自治县', u'海东市循化撒拉族自治县', u'海南藏族自治州贵德县', u'海南藏族自治州兴海县', u'海南藏族自治州贵南县', u'海南藏族自治州同德县', u'海南藏族自治州共和县', u'海西蒙古族藏族自治州德令哈市', u'海西蒙古族藏族自治州乌兰县', u'海西蒙古族藏族自治州天峻县', u'海西蒙古族藏族自治州格尔木市', u'海西蒙古族藏族自治州都兰县', u'海西蒙古族藏族自治州茫崖行政委员会', u'海西蒙古族藏族自治州冷湖行政委员会', u'海西蒙古族藏族自治州大柴旦行政委员会', u'黄南藏族自治州尖扎县', u'黄南藏族自治州同仁县', u'黄南藏族自治州泽库县', u'黄南藏族自治州河南蒙古族自治县', u'西宁市大通回族土族自治县', u'西宁市湟中县', u'西宁市湟源县', u'西宁市城东区', u'西宁市城北区', u'西宁市城西区', u'西宁市城中区', u'玉树藏族自治州治多县', u'玉树藏族自治州曲麻莱县', u'玉树藏族自治州称多县', u'玉树藏族自治州杂多县', u'玉树藏族自治州玉树市', u'玉树藏族自治州囊谦县', u'滨州市无棣县', u'滨州市沾化县', u'滨州市阳信县', u'滨州市滨城区', u'滨州市惠民县', u'滨州市博兴县', u'滨州市邹平县', u'德州市庆云县', u'德州市乐陵市', u'德州市宁津县', u'德州市陵县', u'德州市德城区', u'德州市临邑县', u'德州市平原县', u'德州市武城县', u'德州市禹城市', u'德州市夏津县', u'德州市齐河县', u'东营市利津县', u'东营市垦利县', u'东营市广饶县', u'东营市河口区', u'东营市东营区', u'菏泽市郓城县', u'菏泽市鄄城县', u'菏泽市巨野县', u'菏泽市牡丹区', u'菏泽市东明县', u'菏泽市定陶县', u'菏泽市成武县', u'菏泽市曹县', u'菏泽市单县', u'济南市商河县', u'济南市济阳县', u'济南市章丘市', u'济南市历城区', u'济南市平阴县', u'济南市槐荫区', u'济南市历下区', u'济南市市中区', u'济南市天桥区', u'济南市长清区', u'济宁市梁山县', u'济宁市汶上县', u'济宁市泗水县', u'济宁市曲阜市', u'济宁市兖州区', u'济宁市嘉祥县', u'济宁市任城区', u'济宁市邹城市', u'济宁市金乡县', u'济宁市鱼台县', u'济宁市微山县', u'莱芜市莱城区', u'莱芜市钢城区', u'聊城市高唐县', u'聊城市临清市', u'聊城市茌平县', u'聊城市冠县', u'聊城市东昌府区', u'聊城市东阿县', u'聊城市莘县', u'聊城市阳谷县', u'临沂市沂水县', u'临沂市蒙阴县', u'临沂市沂南县', u'临沂市平邑县', u'临沂市费县', u'临沂市莒南县', u'临沂市兰山区', u'临沂市临沭县', u'临沂市苍山县', u'临沂市郯城县', u'临沂市罗庄区', u'临沂市河东区', u'青岛市莱西市', u'青岛市平度市', u'青岛市即墨市', u'青岛市胶州市', u'青岛市胶南市', u'青岛市黄岛区', u'青岛市崂山区', u'青岛市城阳区', u'青岛市李沧区', u'青岛市市北区', u'青岛市市南区', u'青岛市四方区', u'日照市莒县', u'日照市五莲县', u'日照市东港区', u'日照市岚山区', u'泰安市岱岳区', u'泰安市肥城市', u'泰安市新泰市', u'泰安市东平县', u'泰安市宁阳县', u'泰安市泰山区', u'威海市环翠区', u'威海市荣成市', u'威海市文登市', u'威海市乳山市', u'潍坊市寿光市', u'潍坊市昌邑市', u'潍坊市坊子区', u'潍坊市青州市', u'潍坊市昌乐县', u'潍坊市高密市', u'潍坊市安丘市', u'潍坊市临朐县', u'潍坊市诸城市', u'潍坊市寒亭区', u'潍坊市奎文区', u'潍坊市潍城区', u'烟台市蓬莱市', u'烟台市龙口市', u'烟台市牟平区', u'烟台市栖霞市', u'烟台市招远市', u'烟台市莱州市', u'烟台市海阳市', u'烟台市莱阳市', u'烟台市长岛县', u'烟台市福山区', u'烟台市莱山区', u'烟台市芝罘区', u'枣庄市滕州市', u'枣庄市峄城区', u'枣庄市山亭区', u'枣庄市市中区', u'枣庄市薛城区', u'枣庄市台儿庄区', u'淄博市高青县', u'淄博市桓台县', u'淄博市淄川区', u'淄博市沂源县', u'淄博市博山区', u'淄博市周村区', u'淄博市张店区', u'淄博市临淄区', u'大同市天镇县', u'大同市阳高县', u'大同市矿区', u'大同市大同县', u'大同市左云县', u'大同市广灵县', u'大同市浑源县', u'大同市灵丘县', u'大同市城区', u'大同市南郊区', u'大同市新荣区', u'晋城市沁水县', u'晋城市高平市', u'晋城市陵川县', u'晋城市泽州县', u'晋城市阳城县', u'晋城市城区', u'晋中市寿阳县', u'晋中市榆次区', u'晋中市昔阳县', u'晋中市和顺县', u'晋中市太谷县', u'晋中市祁县', u'晋中市榆社县', u'晋中市平遥县', u'晋中市左权县', u'晋中市介休市', u'晋中市灵石县', u'临汾市永和县', u'临汾市隰县', u'临汾市汾西县', u'临汾市霍州市', u'临汾市蒲县', u'临汾市古县', u'临汾市大宁县', u'临汾市洪洞县', u'临汾市安泽县', u'临汾市尧都区', u'临汾市吉县', u'临汾市乡宁县', u'临汾市浮山县', u'临汾市襄汾县', u'临汾市翼城县', u'临汾市曲沃县', u'临汾市侯马市', u'吕梁市兴县', u'吕梁市岚县', u'吕梁市临县', u'吕梁市方山县', u'吕梁市文水县', u'吕梁市交城县', u'吕梁市离石区', u'吕梁市柳林县', u'吕梁市中阳县', u'吕梁市汾阳市', u'吕梁市孝义市', u'吕梁市石楼县', u'吕梁市交口县', u'朔州市右玉县', u'朔州市平鲁区', u'朔州市怀仁县', u'朔州市山阴县', u'朔州市应县', u'朔州市朔城区', u'太原市阳曲县', u'太原市娄烦县', u'太原市古交市', u'太原市晋源区', u'太原市清徐县', u'太原市小店区', u'太原市万柏林区', u'太原市迎泽区', u'太原市杏花岭区', u'太原市尖草坪区', u'忻州市繁峙县', u'忻州市河曲县', u'忻州市神池县', u'忻州市代县', u'忻州市五寨县', u'忻州市原平市', u'忻州市宁武县', u'忻州市五台县', u'忻州市保德县', u'忻州市岢岚县', u'忻州市忻府区', u'忻州市定襄县', u'忻州市静乐县', u'忻州市偏关县', u'阳泉市盂县', u'阳泉市平定县', u'阳泉市郊区', u'阳泉市城区', u'阳泉市矿区', u'运城市新绛县', u'运城市河津市', u'运城市稷山县', u'运城市绛县', u'运城市闻喜县', u'运城市万荣县', u'运城市垣曲县', u'运城市盐湖区', u'运城市临猗县', u'运城市夏县', u'运城市永济市', u'运城市平陆县', u'运城市芮城县', u'长治市武乡县', u'长治市沁源县', u'长治市沁县', u'长治市黎城县', u'长治市襄垣县', u'长治市屯留县', u'长治市潞城市', u'长治市平顺县', u'长治市郊区', u'长治市壶关县', u'长治市长子县', u'长治市长治县', u'长治市城区', u'安康市宁陕县', u'安康市石泉县', u'安康市汉滨区', u'安康市旬阳县', u'安康市汉阴县', u'安康市白河县', u'安康市紫阳县', u'安康市平利县', u'安康市岚皋县', u'安康市镇坪县', u'宝鸡市陇县', u'宝鸡市麟游县', u'宝鸡市千阳县', u'宝鸡市陈仓区', u'宝鸡市凤翔县', u'宝鸡市岐山县', u'宝鸡市扶风县', u'宝鸡市眉县', u'宝鸡市凤县', u'宝鸡市太白县', u'宝鸡市金台区', u'宝鸡市渭滨区', u'汉中市留坝县', u'汉中市佛坪县', u'汉中市洋县', u'汉中市城固县', u'汉中市略阳县', u'汉中市勉县', u'汉中市汉台区', u'汉中市宁强县', u'汉中市西乡县', u'汉中市南郑县', u'汉中市镇巴县', u'商洛市洛南县', u'商洛市商州区', u'商洛市丹凤县', u'商洛市柞水县', u'商洛市商南县', u'商洛市山阳县', u'商洛市镇安县', u'铜川市宜君县', u'铜川市印台区', u'铜川市耀州区', u'铜川市王益区', u'渭南市韩城市', u'渭南市白水县', u'渭南市澄城县', u'渭南市合阳县', u'渭南市蒲城县', u'渭南市富平县', u'渭南市大荔县', u'渭南市临渭区', u'渭南市华阴市', u'渭南市潼关县', u'渭南市华县', u'西安市临潼区', u'西安市高陵县', u'西安市蓝田县', u'西安市长安区', u'西安市户县', u'西安市周至县', u'西安市灞桥区', u'西安市未央区', u'西安市莲湖区', u'西安市雁塔区', u'西安市碑林区', u'西安市新城区', u'西安市阎良区', u'咸阳市旬邑县', u'咸阳市长武县', u'咸阳市彬县', u'咸阳市淳化县', u'咸阳市永寿县', u'咸阳市礼泉县', u'咸阳市三原县', u'咸阳市乾县', u'咸阳市泾阳县', u'咸阳市渭城区', u'咸阳市兴平市', u'咸阳市武功县', u'咸阳市杨凌区', u'咸阳市秦都区', u'延安市子长县', u'延安市吴起县', u'延安市安塞县', u'延安市志丹县', u'延安市延川县', u'延安市宝塔区', u'延安市延长县', u'延安市甘泉县', u'延安市富县', u'延安市宜川县', u'延安市洛川县', u'延安市黄龙县', u'延安市黄陵县', u'榆林市府谷县', u'榆林市神木县', u'榆林市榆阳区', u'榆林市佳县', u'榆林市横山县', u'榆林市米脂县', u'榆林市靖边县', u'榆林市定边县', u'榆林市子洲县', u'榆林市绥德县', u'榆林市吴堡县', u'榆林市清涧县', u'上海市崇明县', u'上海市金山区', u'上海市奉贤区', u'上海市青浦区', u'上海市浦东新区', u'上海市嘉定区', u'上海市宝山区', u'上海市松江区', u'上海市闵行区', u'上海市虹口区', u'上海市徐汇区', u'上海市杨浦区', u'上海市闸北区', u'上海市长宁区', u'上海市普陀区', u'上海市黄浦区', u'上海市静安区', u'上海市卢湾区', u'阿坝藏族羌族自治州若尔盖县', u'阿坝藏族羌族自治州阿坝县', u'阿坝藏族羌族自治州九寨沟县', u'阿坝藏族羌族自治州红原县', u'阿坝藏族羌族自治州松潘县', u'阿坝藏族羌族自治州壤塘县', u'阿坝藏族羌族自治州黑水县', u'阿坝藏族羌族自治州马尔康县', u'阿坝藏族羌族自治州茂县', u'阿坝藏族羌族自治州金川县', u'阿坝藏族羌族自治州理县', u'阿坝藏族羌族自治州小金县', u'阿坝藏族羌族自治州汶川县', u'巴中市南江县', u'巴中市通江县', u'巴中市巴州区', u'巴中市平昌县', u'巴中市恩阳区', u'成都市彭州市', u'成都市都江堰市', u'成都市郫县', u'成都市崇州市', u'成都市金堂县', u'成都市龙泉驿区', u'成都市大邑县', u'成都市双流县', u'成都市邛崃市', u'成都市新津县', u'成都市蒲江县', u'成都市青羊区', u'成都市金牛区', u'成都市成华区', u'成都市锦江区', u'成都市青白江区', u'成都市温江区', u'成都市武侯区', u'成都市新都区', u'达州市宣汉县', u'达州市达川区', u'达州市渠县', u'达州市开江县', u'达州市万源市', u'达州市通川区', u'达州市大竹县', u'德阳市绵竹市', u'德阳市什邡市', u'德阳市旌阳区', u'德阳市中江县', u'德阳市广汉市', u'德阳市罗江县', u'甘孜藏族自治州石渠县', u'甘孜藏族自治州甘孜县', u'甘孜藏族自治州色达县', u'甘孜藏族自治州德格县', u'甘孜藏族自治州炉霍县', u'甘孜藏族自治州白玉县', u'甘孜藏族自治州新龙县', u'甘孜藏族自治州道孚县', u'甘孜藏族自治州丹巴县', u'甘孜藏族自治州理塘县', u'甘孜藏族自治州巴塘县', u'甘孜藏族自治州康定县', u'甘孜藏族自治州雅江县', u'甘孜藏族自治州泸定县', u'甘孜藏族自治州乡城县', u'甘孜藏族自治州稻城县', u'甘孜藏族自治州九龙县', u'甘孜藏族自治州得荣县', u'广安市广安区', u'广安市岳池县', u'广安市武胜县', u'广安市邻水县', u'广安市华蓥市', u'广安市前锋区', u'广元市青川县', u'广元市昭化区', u'广元市旺苍县', u'广元市剑阁县', u'广元市苍溪县', u'广元市朝天区', u'广元市利州区', u'乐山市夹江县', u'乐山市井研县', u'乐山市沙湾区', u'乐山市峨眉山市', u'乐山市金口河区', u'乐山市犍为县', u'乐山市峨边彝族自治县', u'乐山市沐川县', u'乐山市马边彝族自治县', u'乐山市市中区', u'乐山市五通桥区', u'凉山彝族自治州甘洛县', u'凉山彝族自治州木里藏族自治县', u'凉山彝族自治州冕宁县', u'凉山彝族自治州越西县', u'凉山彝族自治州美姑县', u'凉山彝族自治州雷波县', u'凉山彝族自治州喜德县', u'凉山彝族自治州昭觉县', u'凉山彝族自治州金阳县', u'凉山彝族自治州布拖县', u'凉山彝族自治州普格县', u'凉山彝族自治州德昌县', u'凉山彝族自治州宁南县', u'凉山彝族自治州会理县', u'凉山彝族自治州会东县', u'凉山彝族自治州西昌市', u'凉山彝族自治州盐源县', u'泸州市泸县', u'泸州市合江县', u'泸州市纳溪区', u'泸州市叙永县', u'泸州市古蔺县', u'泸州市龙马潭区', u'泸州市江阳区', u'眉山市彭山县', u'眉山市仁寿县', u'眉山市东坡区', u'眉山市丹棱县', u'眉山市洪雅县', u'眉山市青神县', u'绵阳市平武县', u'绵阳市江油市', u'绵阳市北川羌族自治县', u'绵阳市梓潼县', u'绵阳市安县', u'绵阳市游仙区', u'绵阳市盐亭县', u'绵阳市三台县', u'绵阳市涪城区', u'南充市阆中市', u'南充市仪陇县', u'南充市南部县', u'南充市营山县', u'南充市蓬安县', u'南充市西充县', u'南充市高坪区', u'南充市嘉陵区', u'南充市顺庆区', u'内江市资中县', u'内江市威远县', u'内江市隆昌县', u'内江市东兴区', u'内江市市中区', u'攀枝花市盐边县', u'攀枝花市米易县', u'攀枝花市仁和区', u'攀枝花市东区', u'攀枝花市西区', u'遂宁市射洪县', u'遂宁市蓬溪县', u'遂宁市安居区', u'遂宁市大英县', u'遂宁市船山区', u'雅安市宝兴县', u'雅安市芦山县', u'雅安市天全县', u'雅安市雨城区', u'雅安市荥经县', u'雅安市汉源县', u'雅安市石棉县', u'雅安市名山区', u'宜宾市宜宾县', u'宜宾市翠屏区', u'宜宾市江安县', u'宜宾市屏山县', u'宜宾市高县', u'宜宾市长宁县', u'宜宾市珙县', u'宜宾市兴文县', u'宜宾市筠连县', u'宜宾市南溪区', u'资阳市简阳市', u'资阳市乐至县', u'资阳市雁江区', u'资阳市安岳县', u'自贡市荣县', u'自贡市富顺县', u'自贡市大安区', u'自贡市沿滩区', u'自贡市自流井区', u'自贡市贡井区', u'天津市武清区', u'天津市静海县', u'天津市宁河县', u'天津市蓟县', u'天津市滨海新区', u'天津市宝坻区', u'天津市西青区', u'天津市津南区', u'天津市北辰区', u'天津市红桥区', u'天津市南开区', u'天津市河北区', u'天津市东丽区', u'天津市河东区', u'天津市河西区', u'天津市和平区', u'阿里地区日土县', u'阿里地区改则县', u'阿里地区噶尔县', u'阿里地区革吉县', u'阿里地区札达县', u'阿里地区普兰县', u'阿里地区措勤县', u'昌都地区丁青县', u'昌都地区江达县', u'昌都地区昌都县', u'昌都地区类乌齐县', u'昌都地区边坝县', u'昌都地区洛隆县', u'昌都地区贡觉县', u'昌都地区八宿县', u'昌都地区察雅县', u'昌都地区左贡县', u'昌都地区芒康县', u'拉萨市当雄县', u'拉萨市林周县', u'拉萨市堆龙德庆县', u'拉萨市墨竹工卡县', u'拉萨市尼木县', u'拉萨市达孜县', u'拉萨市城关区', u'拉萨市曲水县', u'林芝地区工布江达县', u'林芝地区波密县', u'林芝地区林芝县', u'林芝地区墨脱县', u'林芝地区米林县', u'林芝地区朗县', u'林芝地区察隅县', u'那曲地区班戈县', u'那曲地区双湖县', u'那曲地区安多县', u'那曲地区聂荣县', u'那曲地区申扎县', u'那曲地区巴青县', u'那曲地区比如县', u'那曲地区那曲县', u'那曲地区索县', u'那曲地区嘉黎县', u'那曲地区尼玛县', u'日喀则地区仲巴县', u'日喀则地区昂仁县', u'日喀则地区萨嘎县', u'日喀则地区谢通门县', u'日喀则地区南木林县', u'日喀则地区吉隆县', u'日喀则地区拉孜县', u'日喀则地区日喀则市', u'日喀则地区聂拉木县', u'日喀则地区定日县', u'日喀则地区萨迦县', u'日喀则地区仁布县', u'日喀则地区白朗县', u'日喀则地区江孜县', u'日喀则地区定结县', u'日喀则地区岗巴县', u'日喀则地区康马县', u'日喀则地区亚东县', u'山南地区扎襄县', u'山南地区贡嘎县', u'山南地区乃东县', u'山南地区加查县', u'山南地区桑日县', u'山南地区浪卡子县', u'山南地区曲松县', u'山南地区琼结县', u'山南地区措美县', u'山南地区隆子县', u'山南地区洛扎县', u'山南地区错那县', u'香港', u'阿克苏地区阿克苏市', u'阿克苏地区阿瓦提县', u'阿克苏地区拜城县', u'阿克苏地区柯坪县', u'阿克苏地区库车县', u'阿克苏地区沙雅县', u'阿克苏地区温宿县', u'阿克苏地区乌什县', u'阿克苏地区新和县', u'阿拉尔市', u'阿勒泰地区阿勒泰市', u'阿勒泰地区布尔津县', u'阿勒泰地区福海县', u'阿勒泰地区富蕴县', u'阿勒泰地区哈巴河县', u'阿勒泰地区吉木乃县', u'阿勒泰地区青河县', u'巴音郭楞蒙古自治州博湖县', u'巴音郭楞蒙古自治州和静县', u'巴音郭楞蒙古自治州和硕县', u'巴音郭楞蒙古自治州库尔勒市', u'巴音郭楞蒙古自治州轮台县', u'巴音郭楞蒙古自治州且末县', u'巴音郭楞蒙古自治州若羌县', u'巴音郭楞蒙古自治州尉犁县', u'巴音郭楞蒙古自治州焉耆回族自治县', u'北屯市', u'博尔塔拉蒙古自治州博乐市', u'博尔塔拉蒙古自治州精河县', u'博尔塔拉蒙古自治州温泉县', u'昌吉回族自治州昌吉市', u'昌吉回族自治州阜康市', u'昌吉回族自治州呼图壁县', u'昌吉回族自治州吉木萨尔县', u'昌吉回族自治州玛纳斯县', u'昌吉回族自治州木垒哈萨克自治县', u'昌吉回族自治州奇台县', u'哈密地区巴里坤哈萨克自治县', u'哈密地区哈密市', u'哈密地区伊吾县', u'和田地区策勒县', u'和田地区和田市', u'和田地区和田县', u'和田地区洛浦县', u'和田地区民丰县', u'和田地区墨玉县', u'和田地区皮山县', u'和田地区于田县', u'喀什地区巴楚县', u'喀什地区伽师县', u'喀什地区喀什市', u'喀什地区麦盖提县', u'喀什地区莎车县', u'喀什地区疏附县', u'喀什地区疏勒县', u'喀什地区塔什库尔干塔吉克斯坦自治县', u'喀什地区叶城县', u'喀什地区英吉沙县', u'喀什地区岳普湖县', u'喀什地区泽普县', u'克拉玛依市白碱滩区', u'克拉玛依市独山子区', u'克拉玛依市克拉玛依区', u'克拉玛依市乌尔禾区', u'克孜勒苏柯尔克孜自治州阿合奇县', u'克孜勒苏柯尔克孜自治州阿克陶县', u'克孜勒苏柯尔克孜自治州阿图什市', u'克孜勒苏柯尔克孜自治州乌恰县', u'石河子市', u'塔城地区额敏县', u'塔城地区和布克赛尔蒙古自治县', u'塔城地区沙湾县', u'塔城地区塔城市', u'塔城地区托里县', u'塔城地区乌苏市', u'塔城地区裕民县', u'图木舒克市', u'吐鲁番地区鄯善县', u'吐鲁番地区吐鲁番市', u'吐鲁番地区托克逊县', u'乌鲁木齐市达坂城区', u'乌鲁木齐市米东区', u'乌鲁木齐市沙依巴克区', u'乌鲁木齐市水磨沟区', u'乌鲁木齐市天山区', u'乌鲁木齐市头屯河区', u'乌鲁木齐市乌鲁木齐县', u'乌鲁木齐市新市区', u'五家渠市', u'伊犁哈萨克自治州察布查尔锡伯自治县', u'伊犁哈萨克自治州巩留县', u'伊犁哈萨克自治州霍城县', u'伊犁哈萨克自治州霍尔果斯市', u'伊犁哈萨克自治州奎屯市', u'伊犁哈萨克自治州尼勒克县', u'伊犁哈萨克自治州特克斯县', u'伊犁哈萨克自治州新源县', u'伊犁哈萨克自治州伊宁市', u'伊犁哈萨克自治州伊宁县', u'伊犁哈萨克自治州昭苏县', u'保山市腾冲县', u'保山市隆阳区', u'保山市昌宁县', u'保山市施甸县', u'保山市龙陵县', u'楚雄彝族自治州永仁县', u'楚雄彝族自治州大姚县', u'楚雄彝族自治州武定县', u'楚雄彝族自治州元谋县', u'楚雄彝族自治州姚安县', u'楚雄彝族自治州牟定县', u'楚雄彝族自治州禄丰县', u'楚雄彝族自治州南华县', u'楚雄彝族自治州楚雄市', u'楚雄彝族自治州双柏县', u'大理白族自治州剑川县', u'大理白族自治州鹤庆县', u'大理白族自治州洱源县', u'大理白族自治州云龙县', u'大理白族自治州宾川县', u'大理白族自治州大理市', u'大理白族自治州漾濞彝族自治县', u'大理白族自治州祥云县', u'大理白族自治州永平县', u'大理白族自治州弥渡县', u'大理白族自治州巍山彝族回族自治县', u'大理白族自治州南涧彝族自治县', u'德宏傣族景颇族自治州盈江县', u'德宏傣族景颇族自治州梁河县', u'德宏傣族景颇族自治州陇川县', u'德宏傣族景颇族自治州芒市', u'德宏傣族景颇族自治州瑞丽市', u'迪庆藏族自治州德钦县', u'迪庆藏族自治州香格里拉县', u'迪庆藏族自治州维西傈僳族自治县', u'红河哈尼族彝族自治州泸西县', u'红河哈尼族彝族自治州弥勒市', u'红河哈尼族彝族自治州建水县', u'红河哈尼族彝族自治州石屏县', u'红河哈尼族彝族自治州开远市', u'红河哈尼族彝族自治州个旧市', u'红河哈尼族彝族自治州蒙自市', u'红河哈尼族彝族自治州红河县', u'红河哈尼族彝族自治州元阳县', u'红河哈尼族彝族自治州屏边苗族自治县', u'红河哈尼族彝族自治州绿春县', u'红河哈尼族彝族自治州金平苗族瑶族傣族自治县', u'红河哈尼族彝族自治州河口瑶族自治县', u'昆明市东川区', u'昆明市禄劝彝族苗族自治县', u'昆明市寻甸回族彝族自治县', u'昆明市富民县', u'昆明市嵩明县', u'昆明市西山区', u'昆明市宜良县', u'昆明市安宁市', u'昆明市石林彝族自治县', u'昆明市晋宁县', u'昆明市呈贡区', u'昆明市官渡区', u'昆明市盘龙区', u'昆明市五华区', u'丽江市宁蒗彝族自治县', u'丽江市玉龙纳西族自治县', u'丽江市永胜县', u'丽江市华坪县', u'丽江市古城区', u'临沧市凤庆县', u'临沧市云县', u'临沧市永德县', u'临沧市镇康县', u'临沧市临翔区', u'临沧市耿马傣族佤族自治县', u'临沧市双江拉祜族佤族布朗族傣族自治县', u'临沧市沧源佤族自治县', u'怒江傈僳族自治州贡山独龙族怒族自治县', u'怒江傈僳族自治州福贡县', u'怒江傈僳族自治州兰坪白族普米族自治县', u'怒江傈僳族自治州泸水县', u'普洱市景东彝族自治县', u'普洱市镇沅彝族哈尼族拉祜族自治县', u'普洱市墨江哈尼族自治县', u'普洱市景谷傣族彝族自治县', u'普洱市宁洱哈尼族彝族自治县', u'普洱市澜沧拉祜族自治县', u'普洱市思茅区', u'普洱市西盟佤族自治县', u'普洱市江城哈尼族彝族自治县', u'普洱市孟连傣族拉祜族佤族自治县', u'曲靖市会泽县', u'曲靖市宣威市', u'曲靖市沾益县', u'曲靖市富源县', u'曲靖市马龙县', u'曲靖市罗平县', u'曲靖市陆良县', u'曲靖市师宗县', u'曲靖市麒麟区', u'文山壮族苗族自治州丘北县', u'文山壮族苗族自治州广南县', u'文山壮族苗族自治州富宁县', u'文山壮族苗族自治州砚山县', u'文山壮族苗族自治州文山市', u'文山壮族苗族自治州西畴县', u'文山壮族苗族自治州麻栗坡县', u'文山壮族苗族自治州马关县', u'西双版纳傣族自治州景洪市', u'西双版纳傣族自治州勐海县', u'西双版纳傣族自治州勐腊县', u'玉溪市易门县', u'玉溪市澄江县', u'玉溪市华宁县', u'玉溪市峨山彝族自治县', u'玉溪市红塔区', u'玉溪市江川县', u'玉溪市新平彝族傣族自治县', u'玉溪市通海县', u'玉溪市元江哈尼族彝族傣族自治县', u'昭通市绥江县', u'昭通市水富县', u'昭通市永善县', u'昭通市盐津县', u'昭通市大关县', u'昭通市威信县', u'昭通市彝良县', u'昭通市镇雄县', u'昭通市昭阳区', u'昭通市鲁甸县', u'昭通市巧家县', u'杭州市临安市', u'杭州市萧山区', u'杭州市富阳市', u'杭州市桐庐县', u'杭州市淳安县', u'杭州市建德市', u'杭州市西湖区', u'杭州市滨江区', u'杭州市拱墅区', u'杭州市江干区', u'杭州市上城区', u'杭州市下城区', u'杭州市余杭区', u'湖州市长兴县', u'湖州市吴兴区', u'湖州市安吉县', u'湖州市德清县', u'湖州市南浔区', u'嘉兴市嘉善县', u'嘉兴市秀洲区', u'嘉兴市平湖市', u'嘉兴市桐乡市', u'嘉兴市海盐县', u'嘉兴市海宁市', u'嘉兴市南湖区', u'金华市浦江县', u'金华市义乌市', u'金华市东阳市', u'金华市兰溪市', u'金华市磐安县', u'金华市永康市', u'金华市武义县', u'金华市婺城区', u'金华市金东区', u'丽水市缙云县', u'丽水市莲都区', u'丽水市遂昌县', u'丽水市松阳县', u'丽水市青田县', u'丽水市龙泉市', u'丽水市云和县', u'丽水市景宁畲族自治县', u'丽水市庆元县', u'宁波市慈溪市', u'宁波市余姚市', u'宁波市鄞州区', u'宁波市奉化市', u'宁波市象山县', u'宁波市宁海县', u'宁波市北仑区', u'宁波市镇海区', u'宁波市江北区', u'宁波市江东区', u'宁波市海曙区', u'衢州市开化县', u'衢州市龙游县', u'衢州市常山县', u'衢州市衢江区', u'衢州市江山市', u'衢州市柯城区', u'绍兴市上虞区', u'绍兴市诸暨市', u'绍兴市嵊州市', u'绍兴市新昌县', u'绍兴市柯桥区', u'绍兴市越城区', u'台州市天台县', u'台州市三门县', u'台州市临海市', u'台州市仙居县', u'台州市温岭市', u'台州市玉环县', u'台州市黄岩区', u'台州市路桥区', u'台州市椒江区', u'温州市永嘉县', u'温州市乐清市', u'温州市瑞安市', u'温州市文成县', u'温州市平阳县', u'温州市泰顺县', u'温州市苍南县', u'温州市洞头县', u'温州市鹿城区', u'温州市瓯海区', u'温州市龙湾区', u'舟山市嵊泗县', u'舟山市岱山县', u'舟山市定海区', u'舟山市普陀区', u'重庆市城口县', u'重庆市巫溪县', u'重庆市开县', u'重庆市巫山县', u'重庆市云阳县', u'重庆市奉节县', u'重庆市梁平县', u'重庆市忠县', u'重庆市石柱土家族自治县', u'重庆市垫江县', u'重庆市潼南县', u'重庆市合川区', u'重庆市丰都县', u'重庆市长寿区', u'重庆市渝北区', u'重庆市铜梁县', u'重庆市涪陵区', u'重庆市巴南区', u'重庆市璧山县', u'重庆市大足区', u'重庆市黔江区', u'重庆市彭水苗族土家族自治县', u'重庆市荣昌县', u'重庆市武隆县', u'重庆市永川区', u'重庆市南川区', u'重庆市江津区', u'重庆市酉阳土家族苗族自治县', u'重庆市綦江区', u'重庆市万盛区', u'重庆市秀山土家族苗族自治县', u'重庆市万州区', u'重庆市江北区', u'重庆市大渡口区', u'重庆市九龙坡区', u'重庆市北碚区', u'重庆市南岸区', u'重庆市沙坪坝区', u'重庆市渝中区']
        # 这是用post要提交的数据
        self.postData = {'TAB_QueryConditionItem': '9f2c3acd-0256-4da2-a659-6949c4671a2a',
                         'TAB_QuerySortItemList': '282:False',
                         # 日期
                         'TAB_QuerySubmitConditionData': '9f2c3acd-0256-4da2-a659-6949c4671a2a:',
                         'TAB_QuerySubmitOrderData': '282:False',
                         # 第几页
                         'TAB_QuerySubmitPagerData': ''}
        self.rowName = [u'行政区', u'县', u'市', u'电子监管号', u'项目名称', u'项目位置', u'面积(公顷)', u'土地来源', u'土地用途', u'供地方式', u'土地使用年限',
                        u'行业分类',
                        u'土地级别', u'成交价格(万元)', u'土地使用权人', u'约定容积率下限', u'约定容积率上限', u'约定交地时间', u'约定开工时间', u'约定竣工时间',
                        u'实际开工时间', u'实际竣工时间', u'批准单位', u'合同签订日期']
        # 这是要抓取的数据，我把除了分期约定那四项以外的都抓取了
        self.info = [
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r1_c2_ctrl',  # 0
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r1_c4_ctrl',  # 1
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r17_c2_ctrl',  # 2
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r16_c2_ctrl',  # 3
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r2_c2_ctrl',  # 4
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r2_c4_ctrl',  # 5
            # 这条信息是土地来源，抓取下来的是数字，它要经过换算得到土地来源，不重要，我就没弄了
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r3_c2_ctrl',  # 6
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r3_c4_ctrl',  # 7
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r19_c2_ctrl',  # 8
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r19_c4_ctrl',  # 9
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r20_c2_ctrl',  # 10
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r20_c4_ctrl',  # 11
            ##                'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f3_r2_c1_0_ctrl',
            ##                'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f3_r2_c2_0_ctrl',
            ##                'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f3_r2_c3_0_ctrl',
            ##                'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f3_r2_c4_0_ctrl',
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r9_c2_ctrl',  # 12
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f2_r1_c2_ctrl',
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f2_r1_c4_ctrl',
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r21_c4_ctrl',
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r22_c2',
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r22_c4_ctrl',
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r10_c2_ctrl',
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r10_c4_ctrl',
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r14_c2_ctrl',
            'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r14_c4_ctrl']
        self.heads = {
            'User-Agent': 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_11_1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/46.0.2490.71 Safari/537.36',
            'Host': 'www.landchina.com'}
        self.recordcount = 340
        requests.adapters.DEFAULT_RETRIES = 5
        self.s = requests.Session()
        self.s.keep_alive = False
        self.s.mount('http:www.landchina.com', HTTPAdapter(max_retries=5))

        # 第一步

    def handleDate(self, year, month, day):
        # 返回日期数据
        'return date format %Y-%m-%d'
        date = datetime.date(year, month, day)
        #        print date.datetime.datetime.strftime('%Y-%m-%d')
        return date  # 日期对象

    def timeDelta(self, year, month):
        # 计算一个月有多少天
        date = datetime.date(year, month, 1)
        try:
            date2 = datetime.date(date.year, date.month + 1, date.day)
        except:
            date2 = datetime.date(date.year + 1, 1, date.day)
        dateDelta = (date2 - date).days
        return dateDelta

    def getPageContent(self, pageNum, date):
        # 指定日期和页数，打开对应网页，获取内容
        postData = self.postData.copy()
        # 设置搜索日期
        queryDate = date.strftime('%Y-%m-%d') + '~' + date.strftime('%Y-%m-%d')
        postData['TAB_QuerySubmitConditionData'] += queryDate
        # 设置页数
        postData['TAB_QuerySubmitPagerData'] = str(pageNum)
        # 请求网页
        pageContent = ''
        try:
            r = self.s.post(self.url, data=postData, timeout=60, headers=self.heads)
            r.encoding = 'gb18030'
            pageContent = r.text
        except Exception as e:
            print e
            time.sleep(60)
        # f=open('content.html','w')
        #        f.write(content.encode('gb18030'))
        #        f.close()
        return pageContent

    # 第二步
    def getAllNum(self, date):
        firstContent = ''
        while firstContent == '':
            firstContent = self.getPageContent(1, date)
        if u'没有检索到相关数据' in firstContent:
            print date, 'have', '0 page'
            return 0
        pattern = re.compile(u'<td.*?class="pager".*?>共(.*?)页.*?共(.*?)条记录。*?</td>')
        result = re.search(pattern, firstContent)
        #self.recordcount = 0
        if result == None:
            print date, 'have', '1 page'
            self.recordcount = 0
            return 1
        if int(result.group(1)) <= 200:
            self.recordcount = int(result.group(2))
            print date, 'have', int(result.group(1)), 'page, ', self.recordcount, 'record.'
            return int(result.group(1))
        else:
            print date, 'have', '200 page'
            return 200
            # 第三步

    def getLinks(self, pageNum, date):
        'get all links'
        pageContent = ''
        while pageContent == '':
            pageContent = self.getPageContent(pageNum, date)
        links = []
        pattern = re.compile(u'<a.*?href="default.aspx.*?tabid=386(.*?)".*?>', re.S)
        results = re.findall(pattern, pageContent)
        for result in results:
            links.append('http://www.landchina.com/default.aspx?tabid=386' + result)
        return links

    def getAllLinks(self, allNum, date):
        allLinks = []
        if self.recordcount != 0:
            while len(allLinks) < self.recordcount:
                allLinks = []
                pageNum = 1
                while pageNum <= allNum:
                    links = self.getLinks(pageNum, date)
                    if pageNum < allNum:
                        print 'page', pageNum, 'has', len(links), 'links'
                        while len(links) < 30:
                            print 'links lost! reget links on page', pageNum
                            links = self.getLinks(pageNum, date)
                            print 'page', pageNum, 'has', len(links), 'links'
                    allLinks += links
                    print 'scrapy link from page', pageNum, '/', allNum
                    pageNum += 1
                print self.recordcount - len(allLinks), "record lost"
        else:
            allLinks = self.getLinks(1, date)
        print date, 'have', len(allLinks), 'link'
        #        for link in allLinks:
        #            print str(link)
        return allLinks

    # 第四步
    def getLinkContent(self, link):
        'open the link to get the linkContent'
        # time.sleep(random.random())
        linkContent = ''
        try:
            r = self.s.get(link, timeout=60, headers=self.heads)
            r.encoding = 'gb18030'
            linkContent = r.text
        except Exception as e:
            print e
            time.sleep(60)
        # f=open('linkContent.html','w')
        #        f.write(linkContent.encode('gb18030'))
        #        f.close()
        return linkContent

    def getInfo(self, linkContent):
        "get every item's info"
        data = []
        soup = BeautifulSoup(linkContent, "html.parser")
        s0 = None
        for item in self.info:
            if soup.find(id=item) == None:
                s = ''
            else:
                s = soup.find(id=item).string
                if s == None:
                    s = ''
                if item == 'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r2_c2_ctrl':
                    s0 = s;
                if item == 'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r2_c4_ctrl':
                    if s == s0:
                        s = (u'现有建设用地');
                    elif s == '0':
                        s = (u'新增建设用地');
                    else:
                        s = (u'新增建设用地(来自存量库)');
                data.append(unicode(s.strip()))
                if item == 'mainModuleContainer_1855_1856_ctl00_ctl00_p1_f1_r1_c2_ctrl':
                    c1 = u'需手工填'
                    c2 = u'需手工填'
                    if s.find(u'本级') == 1:
                        print u'本级'
                        c2 = c[0:len(c) - 2]
                    elif s.find(u'兵团') == 1:
                        print u'兵团'
                    else:
                        for c in self.city:
                            if s in c:
                                c1 = s
                                c2 = c[0:len(c) - len(s)]

                    data.append(unicode(c1.strip()))
                    data.append(unicode(c2.strip()))
        return data

    def saveInfo(self, data, date):
        fileName = 'landchina/' + datetime.datetime.strftime(date, '%Y') + '/' + datetime.datetime.strftime(date,
                                                                                                            '%m') + '/' + datetime.datetime.strftime(
            date, '%d') + '.csv'
        if os.path.exists(fileName):
            mode = 'ab'
        else:
            mode = 'wb'
        csvfile = file(fileName, mode)
        writer = csv.writer(csvfile)
        if mode == 'wb':
            writer.writerow([name.encode('gb18030') for name in self.rowName])
        writer.writerow([d.encode('gb18030') for d in data])
        csvfile.close()

    def mkdir(self, date):
        # 创建目录
        path = 'landchina/' + datetime.datetime.strftime(date, '%Y') + '/' + datetime.datetime.strftime(date, '%m')
        isExists = os.path.exists(path)
        if not isExists:
            os.makedirs(path)

    def saveAllInfo(self, allLinks, date):
        for (i, link) in enumerate(allLinks):
            data = []
            linkContent = self.getLinkContent(link)
            data = self.getInfo(linkContent)
            print 'data =',str(data)
            while data == []:
                print 'data from',link, 'return none and then try again'
                linkContent = self.getLinkContent(link)
                data = self.getInfo(linkContent)
                print 'Retrial data =', str(data)
            self.mkdir(date)
            self.saveInfo(data, date)
            print 'save info from link', i + 1, '/', len(allLinks)
